test/planeQGDFoam/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wing
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    "(topAndBottom|inlet|outlet)"
    {
        type            calculated;
        value           uniform 0;
    }
    "(symFront|symBack)"
    {
        type            symmetryPlane;
        value           uniform 0;
    }

}


// ************************************************************************* //
