test/planeQGDFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner
        {
            preconditioner GAMG;
            smoother       GaussSeidel;
            relTol         1e-2;
            tolerance      1e-4;
        }
        tolerance       1e-10;
        relTol          0;
    }

    "(rho|e|U|rhoU|rhoE)"
    {
        $p;
    }

    "(omega|k)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }

    T
    {
        $p;
        nAlphaCorr 1;
        nAlphaSubCycles 1;
    }
 
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       100000;
}

// ************************************************************************* // 
